import re

def format_phone_number(phone_number):
    # 정규식 패턴을 사용하여 전화번호 검사
    pattern = re.compile(
        r'(\(?((010)|(02)|(051)|(053)|(032)|(062)|(042)|(052)|(044)|(031)|(033)|(043)|(041)|(063)|(061)|(054)|(055)|(064))\)? ?-? ?\d{3,4} ?-? ?\d{4})')
    pattern = re.compile(
        r'(\(?((010)|(02)|(051)|(053)|(032)|(062)|(042)|(052)|(044)|(031)|(033)|(043)|(041)|(063)|(061)|(054)|(055)|(064))\)? ?-? ?\d{3,4} ?-? ?\d{4})')

    # 정규식과 일치하는 모든 부분 찾기
    matches = pattern.findall(phone_number)

    # 일치하는 모든 문자열 출력
    for match in matches:
        print(match[0])

# 테스트 데이터
test_phone_number = '''
(031) 8041 - 0550
3533435
34239872
353 3435
01034243424
(031) - 8041 0123
(010) - 333 - 4444
010333344444
010-3333-444
010 333 3444
3542 - 8795
099 - 353 - 3435
010 - 34 - 34554
342498765
'''

# 테스트 실행
format_phone_number(test_phone_number)
